import pytest


example = [{'id': 41428829, 'state': 'EXECUTED'},
           {'id': 939719570, 'state': 'EXECUTED'},
           {'id': 594226727, 'state': 'CANCELED'},
           {'id': 615064591, 'state': 'CANCELED'}]

no_execute = [{"id": 1, "state": "CANCELED"},
               {"id": 2, "state": "COMPLETED"}]

example_data = [{'date': '2019-07-03T18:35:29.512364'},
                 {'date': '2018-06-30T02:08:58.425572'},
                 {'date': '2018-09-12T21:27:25.241689'},
                 {'date': '2018-10-14T08:21:33.419441'},
                 {'date': '2018-10-14T08:21:33.419441'}]


@pytest.fixture(params=[("40817810500001234567", "**4567"),  # Стандартный номер
        ("408178105000012345677", "Вы ввели слишком много символов"),
        ("4081781050000123456", "Вы пропустили некоторое количество символов"),
        ("", ""),
        ("4081 7810 5000 0123 4567", "**4567"),
        ("S40817810500001234567!", "**4567")])
def account_data(request):
    return request.param

@pytest.fixture(params=[("4123 9876 5432 1098", "4123 98** **** 1098"),
        ("412398765432109", "Номер слишком короткий"),
        ("4123-9876-5432-1098", "4123 98** **** 1098"),
        ("4A123.9876F5432!1098", "4123 98** **** 1098")])
def card_fixture(request):
    return request.param

@pytest.fixture(params=[(example, "EXECUTED", [{'id': 41428829, 'state': 'EXECUTED'}, {'id': 939719570, 'state': 'EXECUTED'}]),
        (example, "CANCELED", [{'id': 594226727, 'state': 'CANCELED'}, {'id': 615064591, 'state': 'CANCELED'}]),
        ([], "EXECUTED", []),
        (example, "EXECUTE", []),
        ([], None, []),
        (no_execute, "EXECUTE", [])])
def filter_fixture(request):
    return request.param

@pytest.fixture(params=[([{"date": "2018-10-14T08:21:33.419441"}, {"date": "2019-07-03T18:35:29.512364"}],True, [{"date": "2019-07-03T18:35:29.512364"}, {"date": "2018-10-14T08:21:33.419441"}]),
        ([{"date": "2018-09-14T12:21:27.241698"}, {"date": "2018-09-14T12:21:27.241698"}],True, [{"date": "2018-09-14T12:21:27.241698"}, {"date": "2018-09-14T12:21:27.241698"}]),  # одинаковые даты
        ([{"date": "2018-09-14T12:21:27.241698"}, {"date": "2018-09-14T12:21:27.241698"}],False, [{"date": "2018-09-14T12:21:27.241698"}, {"date": "2018-09-14T12:21:27.241698"}]),
        ([{"date": "2019-07-03T18:35:29.512364"}, {"date": "2018-10-14T08:21:33.419441"}], False, [{"date": "2018-10-14T08:21:33.419441"}, {"date": "2019-07-03T18:35:29.512364"}]),
        ([{"date": "2020-01-01T12:00:00.000002"},{"date": "2020-01-01T12:00:00.000003"},{"date": "2020-01-01T12:00:00.000001"}],True, [{"date": "2020-01-01T12:00:00.000003"},{"date": "2020-01-01T12:00:00.000002"},{"date": "2020-01-01T12:00:00.000001"}]),
        ([{"date": "2020-01-01T12:00:00.000001"},{"date": "2020-01-01T12:00:00.000003"},{"date": "2020-01-01T12:00:00.000002"}],False, [{"date": "2020-01-01T12:00:00.000001"},{"date": "2020-01-01T12:00:00.000002"},{"date": "2020-01-01T12:00:00.000003"}])])
def sort_fixture(request):
    return request.param

@pytest.fixture(params=[("Счет 64686473678894779589", "Счет **9589"),
        ("Visa Classic 6831982476737658", "Visa Classic 6831 98** **** 7658"),
        ("Visa Gold 5999414228426353", "Visa Gold 5999 41** **** 6353"),
        ("", ""),
        (None, ""),
        ("Visa Gold 5999414228426353 ", "Visa Gold 5999 41** **** 6353")])
def mask_fixture(request):
    return request.param

@pytest.fixture(params=[("2024-03-11T02:26:18.671407", "11.03.2024"),
        ("", ""),
        ("2024-01-01", "01.01.2024"),
        ("2024-12-31", "31.12.2024"),
        ("2024-02-29", "29.02.2024"),
        ("2024-02-29!", "29.02.2024")])
def date_fixture(request):
    return request.param
